[
    {
        "title": "Phase 1",
        "items": [
            {
                "title": "Upgrading Name Resolution",
                "description": "The new name resolution process makes a seamless transition from ENSv1 to ENSv2 possible, by providing a consistent interface that will remain the same across both versions of ENS. Deploying a new Universal Resolver will allow us to quickly switch all clients over to the new resolution process when the new L2 infrastructure is deployed.",
                "status": "development"
            },
            {
                "title": "L2 Reverse Resolution",
                "description": "L2 reverse resolution needs to be L2 specific and the new ENSIP will standardise how reverse resolution will be done. Connecting the L2 reverse registrars to L1 requires a new CCIP-read gateway and contracts on each L2. The discovery process also needs to be enabled by the DAO via the root.",
                "status": "development"
            },
            {
                "title": "L2 Selection",
                "description": "Research on which L2 implementation to select and whether or not to deploy our own instance or deploy to an existing public instance.",
                "status": "research"
            }
        ]
    },
    {
        "title": "Phase 2",
        "items": [
            {
                "title": "Write New Contracts for L1 & L2",
                "description": "A new suite of core ENS contracts will be written to rearchitect what we have learnt from the last 7 years of ENS, improving user-experience, particularly around expired and resold names. In addition there will be new contracts for registration, resolvers and other core contracts.",
                "status": "research"
            }
        ]
    },
    {
        "title": "Phase 3",
        "items": [
            {
                "title": "Deploy ENS L2",
                "description": "Set up everything that ENS needs on an existing L2, or its own L2. This includes deploying infrastructure such as sequencers, block explorer, and provers depending on the type of rollup selected.",
                "status": "blocked"
            }
        ]
    },
    {
        "title": "Phase 4",
        "items": [
            {
                "title": "Deploy Initial Contracts on L1 & L2",
                "description": "Initial registries, resolvers, registrars and migration contracts will be deployed.",
                "status": "blocked"
            },
            {
                "title": "Sync Registrations and Renewals to ENS L2",
                "description": "Once contracts are deployed a sync process will initiate to sync data with the legacy contracts. The old registrar on L1 will need to be halted during the final stage of the sync to prevent duplicate registrations.",
                "status": "blocked"
            }
        ]
    },
    {
        "title": "Phase 5",
        "items": [
            {
                "title": "Switch Resolution Process to New Contracts",
                "description": "The Universal resolver will switch to the new registries and begin using the new infrastructure.",
                "status": "blocked"
            },
            {
                "title": "Start Registrations Again",
                "description": "Once everything is confirmed to be synced correctly, the process of registration and renewals can start on ENS L2.",
                "status": "blocked"
            }
        ]
    }
]
